Revit 2027 API
PostPattern.StartPost Property
 Accesses the object containing properties related to the start post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterInfo StartPost { get; }
Public ReadOnly Property StartPost As BalusterInfo
	Get
public:
property BalusterInfo^ StartPost {
	BalusterInfo^ get ();
}
member StartPost : BalusterInfo with get
Property Value
BalusterInfo
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace